In [1]:
 #code1: Dropping rows with at least 1 null value.



# importing pandas as pd 
import pandas as pd 
  
# importing numpy as np 
import numpy as np 
  
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, 40, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
  
# creating a dataframe from dictionary 
df = pd.DataFrame(dict) 
    
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [2]:
#Now we drop rows with at least one Nan value (Null value)
 
# using dropna() function   
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [3]:
#Code2: Dropping rows if all values in that row are missing.

# using dropna() function     
df.dropna(how = 'all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [4]:
#Now we drop a columns which have at least 1 missing values

df.dropna(axis = 1)

   Third Score
0           52
1           40
2           80
3           98

In [5]:
 #Code4: Dropping Rows with at least 1 null value in CSV file.
    
 # making data frame from csv file  
data = pd.read_csv(r'C:\Users\Administrateur\Downloads\employees.csv')
data.sample(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
788,Michelle,NaN,3/31/2012,6:28 AM,124441,16.353,False,Business Development
121,Kathleen,NaN,5/9/2016,8:55 AM,119735,18.740,False,Product
696,Samuel,Male,5/25/2012,4:40 PM,85550,11.593,True,Marketing
643,Shawn,Male,9/29/1987,10:11 PM,71975,9.770,False,Human Resources
660,Mary,NaN,12/24/1986,7:02 PM,100341,6.662,False,Distribution

In [6]:
data.shape

(1000, 8)

In [7]:
# making new data frame with dropped NA values  
new_data = data.dropna(axis = 0, how ='any')  
    
new_data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [8]:
new_data.shape

(764, 8)

In [9]:
print("Old data frame length:", len(data)) 
print("New data frame length:", len(new_data))  
print("Number of rows with at least 1 NA value: ", 
      (len(data)-len(new_data)))

Old data frame length: 1000
New data frame length: 764
Number of rows with at least 1 NA value:  236

Drop rows from the dataframe based on certain condition applied on a column

In [10]:
# Read the csv file and construct the  
# dataframe 
df = pd.read_csv(r'C:\Users\Administrateur\Downloads\nba.csv')

In [11]:
# Visualize the dataframe 
df.head(15)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0

In [12]:
# Print the shape of the dataframe 
print(df.shape)

(458, 9)

In [13]:
# Filter all rows for which the player's 
# age is greater than or equal to 25 
df_filtered = df[df['Age'] >= 25]

In [14]:
# Print the new dataframe 
df_filtered.head(15)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
15,Bojan Bogdanovic,Brooklyn Nets,44.0,SG,27.0,6-8,216.0,NaN,3425510.0
17,Wayne Ellington,Brooklyn Nets,21.0,SG,28.0,6-4,200.0,North Carolina,1500000.0
19,Jarrett Jack,Brooklyn Nets,2.0,PG,32.0,6-3,200.0,Georgia Tech,6300000.0
21,Sean Kilpatrick,Brooklyn Nets,6.0,SG,26.0,6-4,219.0,Cincinnati,134215.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0
25,Willie Reed,Brooklyn Nets,33.0,PF,26.0,6-10,220.0,Saint Louis,947276.0

In [15]:
# Print the shape of the dataframe 
df_filtered.shape

(303, 9)

In [16]:
difference = len(df) - len(df_filtered)
difference

155

We can use the DataFrame.drop() function to drop such rows which does not satisfy the given condition.

In [17]:
# First filter out those rows which 
# does not contain any data 
df = df.dropna(how = 'all') 
  
# Filter all rows for which the player's 
# age is greater than or equal to 25 
df.drop(df[df['Age'] < 25].index, inplace = True) 
  
# Print the modified dataframe 
print(df.head(15)) 
  
# Print the shape of the dataframe 
print(df.shape)

                Name            Team  Number Position   Age Height  Weight  \
0      Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1        Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2       John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
4      Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
5       Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0
7       Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0
11     Isaiah Thomas  Boston Celtics     4.0       PG  27.0    5-9   185.0
12       Evan Turner  Boston Celtics    11.0       SG  27.0    6-7   220.0
14      Tyler Zeller  Boston Celtics    44.0        C  26.0    7-0   253.0
15  Bojan Bogdanovic   Brooklyn Nets    44.0       SG  27.0    6-8   216.0
17   Wayne Ellington   Brooklyn Nets    21.0       SG  28.0    6-4   200.0
19      Jarrett Jack   Brooklyn Nets     2.0       PG  32.0    6-3   200.0
21   Sean Kilpatrick   Brooklyn Nets     6.0       SG  26.0    6-4   219.0
23       Brook Lopez   Brooklyn Nets    11.0        C  28.0    7-0   275.0
25       Willie Reed   Brooklyn Nets    33.0       PF  26.0   6-10   220.0

              College      Salary
0               Texas   7730337.0
1           Marquette   6796117.0
2   Boston University         NaN
4                 NaN   5000000.0
5                 NaN  12000000.0
7             Gonzaga   2165160.0
11         Washington   6912869.0
12         Ohio State   3425510.0
14     North Carolina   2616975.0
15                NaN   3425510.0
17     North Carolina   1500000.0
19       Georgia Tech   6300000.0
21         Cincinnati    134215.0
23           Stanford  19689000.0
25        Saint Louis    947276.0
(303, 9)

How to drop one or multiple columns in Pandas Dataframe

In [18]:
# create a dictionary with five fields each 
data = { 
    'A':['A1', 'A2', 'A3', 'A4', 'A5'],  
    'B':['B1', 'B2', 'B3', 'B4', 'B5'],  
    'C':['C1', 'C2', 'C3', 'C4', 'C5'],  
    'D':['D1', 'D2', 'D3', 'D4', 'D5'],  
    'E':['E1', 'E2', 'E3', 'E4', 'E5'] }

In [19]:
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
  
df

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [20]:
#Remove specific single column.

# Remove column name 'A' 
df.drop(['A'], axis = 1)

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

In [21]:
#Remove specific multiple columns.

# Remove two columns name is 'C' and 'D' 
df.drop(['C', 'D'], axis = 1)

    A   B   E
0  A1  B1  E1
1  A2  B2  E2
2  A3  B3  E3
3  A4  B4  E4
4  A5  B5  E5

In [22]:
#Remove columns as based on column index.

# Remove three columns as index base 
df.drop(df.columns[[0, 4, 2]], axis = 1, inplace = True) 
  
df

    B   D
0  B1  D1
1  B2  D2
2  B3  D3
3  B4  D4
4  B5  D5

Drop Columns from a Dataframe using iloc[] and drop() method.

Remove all columns between a specific column to another columns.

In [23]:
# create a dictionary with five fields each  
data = { 
    'A':['A1', 'A2', 'A3', 'A4', 'A5'],  
    'B':['B1', 'B2', 'B3', 'B4', 'B5'],  
    'C':['C1', 'C2', 'C3', 'C4', 'C5'],  
    'D':['D1', 'D2', 'D3', 'D4', 'D5'],  
    'E':['E1', 'E2', 'E3', 'E4', 'E5'] } 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
# Remove all columns between column index 1 to 3 
df.drop(df.iloc[:, 1:3], inplace = True, axis = 1) 
  
df

    A   D   E
0  A1  D1  E1
1  A2  D2  E2
2  A3  D3  E3
3  A4  D4  E4
4  A5  D5  E5

Drop Columns from a Dataframe using ix() and drop() method.

Remove all columns between a specific column name to another columns name.

In [24]:
# Import pandas package  
import pandas as pd 
  
# create a dictionary with five fields each  
data = { 
    'A':['A1', 'A2', 'A3', 'A4', 'A5'],  
    'B':['B1', 'B2', 'B3', 'B4', 'B5'],  
    'C':['C1', 'C2', 'C3', 'C4', 'C5'],  
    'D':['D1', 'D2', 'D3', 'D4', 'D5'],  
    'E':['E1', 'E2', 'E3', 'E4', 'E5'] } 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 

df

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

Remove all columns between a specific column name to another columns name.

In [25]:
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
for col in df.columns: 
    if 'A' in col: 
        del df[col] 

        
df

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

In [26]:
# Python code to demonstrate the working of  
# logical_and(), logical_or(), logical_xor() 
# and logical_invert() 
  
# importing "decimal" module to use decimal functions 
import decimal 
  
# Initializing decimal number 
a = decimal.Decimal(1000) 
  
# Initializing decimal number 
b = decimal.Decimal(1110)

In [32]:
b.logical_and(a)

Decimal('1000')

In [27]:
# printing logical_and of two numbers 
print ("The logical_and() of two numbers is : ",end="") 
print (a.logical_and(b))

The logical_and() of two numbers is : 1000

In [28]:
# printing exclusive or of two numbers 
print ("The exclusive or of two numbers is : ",end="") 
print (a.logical_xor(b))

The exclusive or of two numbers is : 110

In [29]:
# printing logical inversion of number 
print ("The logical inversion of number is : ",end="") 
print (a.logical_invert())

The logical inversion of number is : 1111111111111111111111110111

In [33]:
# Python code to demonstrate the working of  
# next_plus() and next_minus() 
  
# importing "decimal" module to use decimal functions 
import decimal 
  
# Initializing decimal number 
a = decimal.Decimal(101.34) 
  
# printing the actual decimal number 
print ("The original number is : ",end="") 
print (a)

The original number is : 101.340000000000003410605131648480892181396484375

In [34]:
# printing number after using next_plus() 
print ("The smallest number larger than current number : ",end="") 
print (a.next_plus())

The smallest number larger than current number : 101.3400000000000034106051317

In [35]:
# printing number after using next_minus() 
print ("The largest number smaller than current number : ",end="") 
print (a.next_minus())

The largest number smaller than current number : 101.3400000000000034106051316

In [36]:
# Python code to demonstrate the working of  
# next_toward() and normalize() 
  
# importing "decimal" module to use decimal functions 
import decimal 
  
# Initializing decimal number 
a = decimal.Decimal(101.34) 
  
# Initializing decimal number 
b = decimal.Decimal(-101.34) 
  
# Initializing decimal number 
c = decimal.Decimal(-58.68) 
  
# Initializing decimal number 
d = decimal.Decimal(14.010000000)

In [37]:
# printing the number using next_toward() 
print ("The number closest to 1st number in direction of second number : ") 
print (a.next_toward(c))

The number closest to 1st number in direction of second number :
101.3400000000000034106051316

In [38]:
# printing the number using next_toward() 
# when equal 
print ("The second number with sign of first number is : ",end="") 
print (b.next_toward(a))

The second number with sign of first number is : -101.3400000000000034106051316

In [39]:
# printing number after erasing rightmost trailing zeroes 
print ("Number after erasing rightmost trailing zeroes : ",end="") 
print (d.normalize())

Number after erasing rightmost trailing zeroes : 14.00999999999999978683717927

In [40]:
# Python code to demonstrate the working of  
# quantize() and same_quantum() 
   
# importing "decimal" module to use decimal functions 
import decimal 
   
# Initializing decimal number 
a = decimal.Decimal(20.76548) 
   
# Initializing decimal number 
b = decimal.Decimal(12.25) 
  
# Initializing decimal number 
c = decimal.Decimal(6.25)

In [41]:
# printing quantized first number 
print ("The quantized first number is : ",end="") 
print (a.quantize(b))

The quantized first number is : 20.77

In [42]:
# checking if both number have same exponent 
if (b.same_quantum(c)): 
       print ("Both the numbers have same exponent") 
else : print ("Both numbers have different exponent")

Both the numbers have same exponent

In [43]:
# Python code to demonstrate the working of  
# rotate() and shift() 

# Initializing decimal number 
a = decimal.Decimal(2343509394029424234334563465)

In [44]:
# using rotate() to rotate the first argument 
# rotates to right by 2 positions 
print ("The rotated value is : ",end="") 
print (a.rotate(-2))

The rotated value is : 6523435093940294242343345634

In [46]:
# using shift() to shift the first argument 
# rotates to left by 2 positions 

# Initializing decimal number 
a = decimal.Decimal(2343509394029424234334563465)

print ("The shifted value is : ",end="") 
print (a.shift(2))

The shifted value is : 4350939402942423433456346500

In [47]:
# Python code to demonstrate the working of  
# remainder_near() and scaleb() 

# Initializing decimal number 
a = decimal.Decimal(23.765) 
  
# Initializing decimal number 
b = decimal.Decimal(12) 
  
# Initializing decimal number 
c = decimal.Decimal(8)

In [48]:
# using remainder_near to compute value 
print ("The computed value using remainder_near() is : ",end="") 
print (b.remainder_near(c))

The computed value using remainder_near() is : -4

In [49]:
# using scaleb() to shift exponont 
print ("The value after shifting exponent : ",end="") 
print (a.scaleb(2))

The value after shifting exponent : 2376.500000000000056843418861